// Тема: Викторина по Scratch

export const quizQuestions = [
  {
    id: 'q4',
    question: 'Как называется персонаж на сцене в Scratch?',
    options: ['Модель', 'Фигура', 'Актёр', 'Спрайт'],
    correctIndex: 3,
  },
  {
    id: 'q7',
    question: 'Что делает блок «Изменить x на 10»?',
    options: [
      'Меняет громкость на 10',
      'Увеличивает спрайт',
      'Двигает спрайт вправо на 10',
      'Поворачивает спрайт',
    ],
    correctIndex: 2,
  },
  {
    id: 'q1',
    question: 'Какой блок запускает программу в Scratch?',
    options: [
      'Повторять всегда',
      'Ждать 1 секунду',
      'Когда зелёный флажок нажат',
      'Когда клавиша нажата',
    ],
    correctIndex: 2,
  },
  {
    id: 'q6',
    question: 'В какой категории находится блок «Если ... то»?',
    options: ['Внешность', 'Управление', 'Движение', 'Событие'],
    correctIndex: 1,
  },
  {
    id: 'q3',
    question: 'Что делает блок «Повторить 10 раз»?',
    options: [
      'Перемещает спрайт на 10 шагов',
      'Ждёт 10 секунд',
      'Удаляет спрайт',
      'Выполняет блоки внутри него 10 раз',
    ],
    correctIndex: 3,
  },
  {
    id: 'q8',
    question: 'Какой цвет у блоков категории «Движение» в Scratch?',
    options: ['Зелёный', 'Синий', 'Жёлтый', 'Фиолетовый'],
    correctIndex: 1,
  },
  {
    id: 'q5',
    question: 'Какой блок используется, чтобы спрайт сказал что-то?',
    options: [
      'Повернуть на 15 градусов',
      'Сказать «Привет!»',
      'Играть звук',
      'Идти 10 шагов',
    ],
    correctIndex: 1,
  },
  {
    id: 'q2',
    question: 'К какой категории относится блок «Идти 10 шагов»?',
    options: ['Операторы', 'Движение', 'Звуки', 'Управление'],
    correctIndex: 1,
  },
]
